[
  {
    "id": "b9e835be-7dd1-4895-a501-f9f2d51ea58b",
    "name": "Danske Bank Organisation",
    "capability": 0,
    "description": "# Overview of Danske Bank\n\nDanske Bank is a leading Nordic bank with a strong international presence. The bank offers a wide range of financial products and services to personal and business customers in Denmark, Finland, Norway, Sweden, and Northern Ireland1. This report provides a detailed overview of Danske Bank's current business activities, including its IT infrastructure and systems, to support the development of a business capability mode.\n\n## Business Overview\n\nDanske Bank is a financial services group headquartered in Copenhagen, Denmark. Founded in 1871, the bank has grown to become a major player in the Nordic banking market. Danske Bank is committed to providing its customers with a wide range of financial products and services, including:\n\nBanking: Checking and savings accounts, loans, mortgages, and cards.\n\nInvesting: Mutual funds, stocks, bonds, and retirement planning.\n\nInsurance: Auto, home, life, and health insurance.\n\nBusiness Banking: A comprehensive suite of banking solutions tailored to the needs of businesses, including checking and savings accounts, loans, and cards.\n\nDanske Bank is also focused on sustainability and has a dedicated section on its website that provides information about its strategic direction, offerings, publications, and policies related to environmental, social, and governance (ESG) factors. In addition, the bank is actively working to reduce costs and improve efficiency as part of its overall strategy.\n\n### Financial Performance\n\nDanske Bank has demonstrated strong financial performance in recent years. In 2023, the bank reported a total income of 52.45 kr. billion and operating expenses of around 25.8 billion. The bank also reported a number of one-off items, including transaction costs related to the sale of its personal customer business in Norway, a gain from the sale of shares, and interest compensation related to a tax decision. \n\n## IT Infrastructure and Systems\n\nDanske Bank is committed to investing in digitalization and cloud technology to enhance its customer experience and operational efficiency. The bank has stated its ambition to be a \"leading bank in a digital age.\" To achieve this, Danske Bank has undertaken a significant IT transformation initiative, including a multi-year agreement with Amazon Web Services (AWS) to migrate selected infrastructure, applications, and data to the cloud. This migration involves:\n\nCloud Migration: Transferring over 16,600 virtual and physical servers and more than 1,000 applications from Danske Bank's private cloud to AWS6. Notably, Danske Bank aims to complete this migration faster than the typical 5-8 years for organizations of their size.\n\nDigital Transformation: Leveraging AWS's cloud technologies, including artificial intelligence (AI) and machine learning, to develop new digital solutions and improve customer service.\n\nHyperautomation: Implementing AWS technologies to automate processes and improve efficiency.\n\nCore Banking Systems: Continuing to run core banking and customer information systems on the IBM Z platform, using two IBM z16 mainframes in an ultra-high-availability GDPS cluster.\n\nTo support this transition, Danske Bank is investing in training its employees on AWS cloud technologies. The bank plans to provide AWS training to more than 1,500 employees and embed cloud skills into management courses to accelerate cloud adoption.\n\nDanske Bank has an extensive software development capability.\n\n## Investor Relations\n\nDanske Bank provides comprehensive information for investors through its Investor Relations section on its website. This section includes detailed information about the bank's financial performance, strategy, and governance1. Key resources available to investors include:\n\nShares: Information about Danske Bank's share price, dividends, and shareholder structure1.\n\nShare Buy-back Program: Danske Bank has an active share buy-back program. As of December 20, 2024, the bank had repurchased a total of 25,708,740 shares with a gross value of 5,188,068,766 DKK10.\n\nReports: Access to the bank's annual reports, interim reports, and other financial publications.\n\nRegulation: Information about the regulatory environment in which Danske Bank operates.\n\nDebt: Details about the bank's debt issuances and credit ratings.\n\n## Careers\n\nDanske Bank offers a variety of career opportunities across different functions and locations. The bank's Careers section on its website provides information about the different career paths available, including:\n\nJoining us: Information about the recruitment process and the types of roles available at Danske Bank.\n\nLeaders: Insights into the bank's leadership team and their vision for the future.\n\nIT Professionals: Opportunities for IT professionals to contribute to the bank's technology initiatives.\n\nBusiness Professionals: Roles for professionals with expertise in areas such as finance, risk management, and customer service.\n\n## News and Reports\n\nDanske Bank actively communicates its news and updates through various channels, including press releases, news articles, and company announcements. These sources provide valuable insights into the bank's current business activities and strategic direction.\n\n### Financial Performance and Strategic Updates\n\nProfit Upgrade: Danske Bank revised its 2024 net profit outlook upwards, driven by an improving macroeconomic environment, good customer activity, and strong credit quality. This highlights the bank's positive financial performance and its ability to adapt to changing market conditions.\n\nNordic Outlook: Danske Bank's economic research team published a report on the Nordic economic outlook, highlighting the potential benefits of lower interest rates and increased spending power. This demonstrates the bank's expertise in economic analysis and its commitment to providing valuable insights to its clients and stakeholders.\n\n### Sustainability Initiatives\n\nRural Housing Association Funding: Danske Bank provided a £25 million funding package to the Rural Housing Association to support the development of over 300 homes.\n\nYoung Enterprise Biodiversity Programme: Danske Bank partnered with Young Enterprise to launch a new biodiversity program for schools.\n\nGreen Leadership Recognition: Danske Bank was recognized for its environmental leadership in an annual survey report, achieving Platinum status.\n\nThese initiatives demonstrate Danske Bank's commitment to sustainability and its efforts to support environmental and social causes.\n\n## Conclusion\n\nDanske Bank is a leading financial institution with a strong commitment to providing a wide range of financial products and services to its customers1. The bank is actively investing in digitalization and cloud technology to enhance its customer experience and operational efficiency5. This analysis of Danske Bank has provided a detailed overview of its current business activities, including its IT infrastructure and systems, which can be used to develop a comprehensive business capability model.\n\nThis model can help to identify and analyze the bank's key business capabilities, enabling it to optimize its operations and achieve its strategic goals. For example, the information presented in this report can be used to define capabilities such as:\n\nCustomer Relationship Management: This capability encompasses all the activities related to acquiring, serving, and retaining customers. It includes functions such as marketing, sales, customer service, and customer onboarding.\n\nProduct Development: This capability involves the design, development, and launch of new financial products and services. It includes activities such as market research, product design, and product testing.\n\nRisk Management: This capability focuses on identifying, assessing, and mitigating risks across the bank's operations. It includes functions such as credit risk management, market risk management, and operational risk management.\n\nIT Management: This capability encompasses all the activities related to managing the bank's IT infrastructure and systems. It includes functions such as infrastructure management, application development, and cybersecurity.\n\nBy developing a clear understanding of its key business capabilities, Danske Bank can ensure that it has the right resources and processes in place to meet its strategic objectives. Furthermore, the bank's commitment to both sustainability and financial performance 11 suggests a balanced approach to business that considers both profitability and social responsibility. This approach can be integrated into the business capability model to ensure that sustainability is considered in all aspects of the bank's operations.",
    "parent": null
  },
  {
    "id": "dab87034-5b23-43b1-bacc-73e339b1a565",
    "name": "Customer Relationship Management",
    "capability": 0,
    "description": "Manage interactions with customers to enhance satisfaction, loyalty, and long-term engagement through effective marketing, sales, and service strategies.",
    "parent": "b9e835be-7dd1-4895-a501-f9f2d51ea58b"
  },
  {
    "id": "c5ea8bf0-21f8-4fd2-8878-0088106a2dbe",
    "name": "Product Development",
    "capability": 0,
    "description": "Design, develop, and launch innovative financial products and services while conducting market research to ensure alignment with customer needs.",
    "parent": "b9e835be-7dd1-4895-a501-f9f2d51ea58b"
  },
  {
    "id": "15c9e6a0-6480-4b21-a0e9-38227e2dfca9",
    "name": "Risk Management",
    "capability": 0,
    "description": "Identify, assess, and mitigate various forms of risk, including credit, market, and operational risks, to protect the bank's assets and ensure compliance.",
    "parent": "b9e835be-7dd1-4895-a501-f9f2d51ea58b"
  },
  {
    "id": "6815e0e9-2432-40b4-9db1-371665c7e62f",
    "name": "IT Infrastructure Management",
    "capability": 0,
    "description": "Oversee the bank's IT infrastructure, including cloud systems, cybersecurity, and application development, to ensure reliable and secure operations.",
    "parent": "b9e835be-7dd1-4895-a501-f9f2d51ea58b"
  },
  {
    "id": "3e1b456b-1ba3-4759-89bc-2b79350b71a3",
    "name": "Financial Services Delivery",
    "capability": 0,
    "description": "Provide a wide range of banking products including loans, mortgages, accounts, and investment solutions to meet diverse customer financial needs.",
    "parent": "b9e835be-7dd1-4895-a501-f9f2d51ea58b"
  },
  {
    "id": "f8d12052-5e8e-4f83-aa72-3d0baa87495c",
    "name": "Strategic Financial Planning",
    "capability": 0,
    "description": "Develop and manage the bank's financial strategies, including budgeting, forecasting, and financial performance analysis.",
    "parent": "b9e835be-7dd1-4895-a501-f9f2d51ea58b"
  },
  {
    "id": "55cec9ed-2c77-4272-a87b-d0ef2e2c4276",
    "name": "Digital Transformation",
    "capability": 0,
    "description": "Drive the adoption of digital technologies and practices to enhance operational efficiency and improve customer experiences.",
    "parent": "b9e835be-7dd1-4895-a501-f9f2d51ea58b"
  },
  {
    "id": "9edd7d51-87f5-4314-9008-39ede023ee27",
    "name": "Compliance and Regulatory Management",
    "capability": 0,
    "description": "Ensure adherence to local and international regulations and standards across all banking operations to maintain transparency and trust.",
    "parent": "b9e835be-7dd1-4895-a501-f9f2d51ea58b"
  },
  {
    "id": "2976bb8b-542e-4545-a8c6-191b7f3d8d1b",
    "name": "Sustainability Initiatives",
    "capability": 0,
    "description": "Implement environmentally responsible practices and financial solutions that align with sustainable development goals and address ESG factors.",
    "parent": "b9e835be-7dd1-4895-a501-f9f2d51ea58b"
  },
  {
    "id": "b153b008-45af-4f6c-aab4-80b387a39e45",
    "name": "Investor Relations Management",
    "capability": 0,
    "description": "Communicate effectively with current and potential investors by providing transparent information regarding financial performance, strategies, and shareholder value.",
    "parent": "b9e835be-7dd1-4895-a501-f9f2d51ea58b"
  },
  {
    "id": "503786e7-6a67-416f-9089-9c631e8cfb40",
    "name": "Talent Management and Development",
    "capability": 0,
    "description": "Manage recruitment, training, and development programs to build a skilled workforce that supports the bank's strategic objectives.",
    "parent": "b9e835be-7dd1-4895-a501-f9f2d51ea58b"
  },
  {
    "id": "b4b59a4c-01ba-4e66-a6d8-84f203a9878c",
    "name": "Sales and Distribution Strategy",
    "capability": 0,
    "description": "Develop and execute effective sales and distribution strategies across various channels to optimize market reach and profitability.",
    "parent": "b9e835be-7dd1-4895-a501-f9f2d51ea58b"
  },
  {
    "id": "73ed8f16-4174-4b3d-894c-afeed7e34641",
    "name": "Marketing and Brand Management",
    "capability": 0,
    "description": "Create and implement marketing strategies that enhance the bank's brand and support customer acquisition through targeted campaigns.",
    "parent": "b9e835be-7dd1-4895-a501-f9f2d51ea58b"
  },
  {
    "id": "27826afb-f54a-4abb-b13c-a50a2d0d3258",
    "name": "Customer Onboarding",
    "capability": 0,
    "description": "Facilitate smooth and efficient onboarding processes for new customers, ensuring compliance and satisfaction from the outset.",
    "parent": "b9e835be-7dd1-4895-a501-f9f2d51ea58b"
  },
  {
    "id": "199697af-21c1-4d96-9a9d-ef96299563ff",
    "name": "Innovation Management",
    "capability": 0,
    "description": "Foster a culture of innovation by encouraging idea generation, experimentation, and the implementation of new solutions within the bank.",
    "parent": "b9e835be-7dd1-4895-a501-f9f2d51ea58b"
  },
  {
    "id": "6429e697-b595-4e55-8666-21f59cff82e1",
    "name": "Data Analytics and Insights",
    "capability": 0,
    "description": "Utilize data analytics to gain insights into customer behaviors and market trends, informing strategic decision-making and product improvements.",
    "parent": "b9e835be-7dd1-4895-a501-f9f2d51ea58b"
  },
  {
    "id": "6bfeb326-24e7-4947-a898-c1e9ed0f2f5c",
    "name": "Service Operations Management",
    "capability": 0,
    "description": "Oversee the delivery of customer service across various channels, ensuring quality and consistency in service provision.",
    "parent": "b9e835be-7dd1-4895-a501-f9f2d51ea58b"
  },
  {
    "id": "afdd5767-e64a-4654-b23f-9a89ec5a39e4",
    "name": "Partnership and Alliance Management",
    "capability": 0,
    "description": "Manage relationships with strategic partners and alliances to enhance product offerings and expand market presence.",
    "parent": "b9e835be-7dd1-4895-a501-f9f2d51ea58b"
  },
  {
    "id": "9d893b17-143a-425f-96e9-8365a89211db",
    "name": "Core Banking Operations",
    "capability": 0,
    "description": "Manage the bank's core banking systems and processes that support transactions, account management, and financial reporting.",
    "parent": "b9e835be-7dd1-4895-a501-f9f2d51ea58b"
  },
  {
    "id": "f6962b9d-cbff-484c-a7a0-23c56a8d8393",
    "name": "Corporate Social Responsibility",
    "capability": 0,
    "description": "Integrate social responsibility initiatives into business practices, focusing on community engagement and support for social causes.",
    "parent": "b9e835be-7dd1-4895-a501-f9f2d51ea58b"
  },
  {
    "id": "a32f8bf9-485f-44f9-b030-a5c715921df0",
    "name": "Customer Acquisition Management",
    "capability": 0,
    "description": "Oversee the strategies and processes focused on attracting and acquiring new customers, including lead generation, outreach, and conversion activities to enhance the customer base.",
    "parent": "dab87034-5b23-43b1-bacc-73e339b1a565"
  },
  {
    "id": "db114209-8f65-4ab4-996e-a0bac52c83ef",
    "name": "Customer Engagement Management",
    "capability": 0,
    "description": "Develop and implement strategies to foster ongoing engagement with customers, ensuring that interactions are meaningful and personalized to enhance customer experience and loyalty.",
    "parent": "dab87034-5b23-43b1-bacc-73e339b1a565"
  },
  {
    "id": "a178cdf5-1bbe-4591-98a0-886f02cf6275",
    "name": "Customer Service Optimization",
    "capability": 0,
    "description": "Enhance customer satisfaction by streamlining customer service processes, utilizing feedback, and implementing best practices to resolve issues efficiently and effectively.",
    "parent": "dab87034-5b23-43b1-bacc-73e339b1a565"
  },
  {
    "id": "2b03c641-238c-432e-b425-e6dd93ebdfaa",
    "name": "Customer Retention Strategies",
    "capability": 0,
    "description": "Design and manage initiatives aimed at retaining existing customers, reducing churn rates through loyalty programs, targeted communication, and value-added services.",
    "parent": "dab87034-5b23-43b1-bacc-73e339b1a565"
  },
  {
    "id": "d5f7bdfd-298f-419a-afc2-56f215928e0a",
    "name": "Customer Insights and Analytics",
    "capability": 0,
    "description": "Utilize data analytics to gain insights into customer behavior, preferences, and trends, enabling informed decision-making and tailored service offerings.",
    "parent": "dab87034-5b23-43b1-bacc-73e339b1a565"
  },
  {
    "id": "7412760b-1abc-458b-a2b1-3339a1d47842",
    "name": "Brand Relationship Management",
    "capability": 0,
    "description": "Establish and maintain brand perception among customers through consistent messaging and valuation of customer feedback, reinforcing brand loyalty and trust.",
    "parent": "dab87034-5b23-43b1-bacc-73e339b1a565"
  },
  {
    "id": "33a2a80b-0af8-4f42-b714-20e3b1b178e9",
    "name": "Multi-Channel Communication Management",
    "capability": 0,
    "description": "Manage and coordinate customer interactions across various communication channels (e.g., email, social media, phone) to ensure consistent and responsive communication.",
    "parent": "dab87034-5b23-43b1-bacc-73e339b1a565"
  },
  {
    "id": "21b11eba-e755-4a85-b314-111cd18891d7",
    "name": "Customer Feedback and Improvement Programs",
    "capability": 0,
    "description": "Implement mechanisms for collecting and analyzing customer feedback, using insights to drive continuous improvements in products and services.",
    "parent": "dab87034-5b23-43b1-bacc-73e339b1a565"
  },
  {
    "id": "bee56c0b-d562-438a-82ab-8ba8c3879760",
    "name": "Onboarding Experience Management",
    "capability": 0,
    "description": "Facilitate a seamless onboarding process for new customers, ensuring they understand services and are set up for successful engagement from the outset.",
    "parent": "dab87034-5b23-43b1-bacc-73e339b1a565"
  },
  {
    "id": "6320208b-4b3f-4b86-b0ed-16ca5d619cb2",
    "name": "Sales Enablement and Support",
    "capability": 0,
    "description": "Provide teams with the tools, resources, and information necessary to effectively sell to customers, including training, materials, and customer relationship tools.",
    "parent": "dab87034-5b23-43b1-bacc-73e339b1a565"
  },
  {
    "id": "51671d7c-0098-44c7-8c7b-23296814d7de",
    "name": "Market Research Management",
    "capability": 0,
    "description": "Market Research Management focuses on gathering and analyzing market data to identify customer needs and trends. This sub-capability ensures that product development efforts are data-driven and aligned with market demands, enabling the creation of products that resonate with target audiences.",
    "parent": "c5ea8bf0-21f8-4fd2-8878-0088106a2dbe"
  },
  {
    "id": "320144fa-aa05-4146-9409-0391a340b97f",
    "name": "Product Design and Prototyping",
    "capability": 0,
    "description": "Product Design and Prototyping involves creating product concepts and developing prototypes to validate ideas before full-scale production. This sub-capability streamlines the design process and fosters innovation, allowing teams to iterate and refine products based on user feedback.",
    "parent": "c5ea8bf0-21f8-4fd2-8878-0088106a2dbe"
  },
  {
    "id": "47a5691c-dccb-4002-8844-a3b81fa50627",
    "name": "Regulatory Compliance Integration",
    "capability": 0,
    "description": "Regulatory Compliance Integration ensures that all new financial products and services meet required regulations and standards. This sub-capability minimizes risk by incorporating compliance considerations into the product development lifecycle, providing assurance that offerings are legally sound.",
    "parent": "c5ea8bf0-21f8-4fd2-8878-0088106a2dbe"
  },
  {
    "id": "0d5bb887-0279-4ce0-bd75-dcd0f0d75d97",
    "name": "Product Testing and Validation",
    "capability": 0,
    "description": "Product Testing and Validation is the process of rigorously assessing new products to ensure they meet performance, usability, and reliability standards. This sub-capability provides critical insights through testing, reducing the likelihood of product failures post-launch and enhancing customer satisfaction.",
    "parent": "c5ea8bf0-21f8-4fd2-8878-0088106a2dbe"
  },
  {
    "id": "72cee53b-4920-49e4-ac2c-0fee2c063310",
    "name": "Product Launch Management",
    "capability": 0,
    "description": "Product Launch Management oversees the strategic introduction of new products to the market. This sub-capability encompasses planning, marketing, and execution efforts that align with business objectives, maximizing visibility and adoption while tracking launch success.",
    "parent": "c5ea8bf0-21f8-4fd2-8878-0088106a2dbe"
  },
  {
    "id": "d627e2a7-d4e6-4e6e-b6e3-c9ce7a0cc9c1",
    "name": "Post-Launch Evaluation",
    "capability": 0,
    "description": "Post-Launch Evaluation assesses the performance and reception of newly launched products. This sub-capability gathers feedback and analyzes key performance indicators to determine product success, supporting continuous improvement and informing future product initiatives.",
    "parent": "c5ea8bf0-21f8-4fd2-8878-0088106a2dbe"
  },
  {
    "id": "454486d0-da2d-44e3-a405-313ac3ad1883",
    "name": "Portfolio Management",
    "capability": 0,
    "description": "Portfolio Management involves the strategic oversight of the bank's entire product portfolio, ensuring an optimal mix of offerings that aligns with business goals and market opportunities. This sub-capability facilitates informed decision-making about product development priorities and resource allocation.",
    "parent": "c5ea8bf0-21f8-4fd2-8878-0088106a2dbe"
  },
  {
    "id": "fdf7dbbd-dd70-423b-8998-cc7aed735642",
    "name": "Customer Feedback Integration",
    "capability": 0,
    "description": "Customer Feedback Integration systematically collects and analyzes input from users to shape product enhancements and new development efforts. This sub-capability strengthens customer engagement and ensures that products continue to meet evolving needs, fostering loyalty and satisfaction.",
    "parent": "c5ea8bf0-21f8-4fd2-8878-0088106a2dbe"
  },
  {
    "id": "d9c3f2c6-9480-409f-9fc8-61319994a061",
    "name": "Agile Development Practices",
    "capability": 0,
    "description": "Agile Development Practices instill flexibility and responsiveness in the product development process, allowing teams to adapt quickly to changes and feedback. This sub-capability promotes iterative development and collaboration, resulting in faster time-to-market and improved alignment with customer expectations.",
    "parent": "c5ea8bf0-21f8-4fd2-8878-0088106a2dbe"
  },
  {
    "id": "d7629cc7-8e3e-4cc0-94d4-ebf610b343b8",
    "name": "Innovation Management",
    "capability": 0,
    "description": "Innovation Management fosters a culture of creativity within the product development team by encouraging new ideas and approaches. This sub-capability drives the exploration of novel solutions that can enhance the bank's product offerings, ensuring competitiveness in a rapidly changing market.",
    "parent": "c5ea8bf0-21f8-4fd2-8878-0088106a2dbe"
  },
  {
    "id": "0e23c655-62b7-41d2-bddf-c9cfef63afdb",
    "name": "Credit Risk Assessment",
    "capability": 0,
    "description": "Credit Risk Assessment involves evaluating the creditworthiness of borrowers and potential counterparties to inform lending decisions. This sub-capability focuses on analyzing financial data, assessing repayment capacity, and determining the risk of default, thereby protecting the bank's interests and enhancing profitability.",
    "parent": "15c9e6a0-6480-4b21-a0e9-38227e2dfca9"
  },
  {
    "id": "d38d1fa5-9ee5-4ac4-b3bb-3e2fd910cb5a",
    "name": "Market Risk Management",
    "capability": 0,
    "description": "Market Risk Management entails identifying, measuring, and mitigating risks associated with fluctuations in market prices, interest rates, and currency values. This sub-capability aims to minimize potential losses from adverse market movements, ensuring the bank's financial stability and maintaining investor confidence.",
    "parent": "15c9e6a0-6480-4b21-a0e9-38227e2dfca9"
  },
  {
    "id": "25974f91-7e6a-4040-8a9f-a565a1ec2556",
    "name": "Operational Risk Management",
    "capability": 0,
    "description": "Operational Risk Management encompasses the identification and mitigation of risks arising from internal processes, systems, or personnel. This sub-capability is designed to safeguard the bank's operations from potential disruptions, enhancing resilience and maintaining compliance with regulatory standards.",
    "parent": "15c9e6a0-6480-4b21-a0e9-38227e2dfca9"
  },
  {
    "id": "da1908fb-c811-4d45-aef8-cd6f3f744e5d",
    "name": "Compliance Risk Monitoring",
    "capability": 0,
    "description": "Compliance Risk Monitoring focuses on ensuring adherence to relevant regulatory requirements, industry standards, and internal policies. This sub-capability aims to identify compliance gaps and implement measures to mitigate risks associated with non-compliance, thereby protecting the bank's reputation.",
    "parent": "15c9e6a0-6480-4b21-a0e9-38227e2dfca9"
  },
  {
    "id": "2b743d17-8a86-4d96-9c42-b9760943899d",
    "name": "Risk Reporting and Communication",
    "capability": 0,
    "description": "Risk Reporting and Communication involves the systematic collection, analysis, and presentation of risk-related data to stakeholders. This sub-capability enhances transparency and informed decision-making by providing timely insights into risk exposure, thereby facilitating proactive risk management.",
    "parent": "15c9e6a0-6480-4b21-a0e9-38227e2dfca9"
  },
  {
    "id": "d7b388b4-2db9-43f1-a072-4de2512f2d3e",
    "name": "Insurance and Risk Transfer",
    "capability": 0,
    "description": "Insurance and Risk Transfer refers to the evaluation and acquisition of insurance products to mitigate various risks faced by the bank. This sub-capability aims to manage potential financial impacts from unforeseen events, ensuring business continuity and protecting assets.",
    "parent": "15c9e6a0-6480-4b21-a0e9-38227e2dfca9"
  },
  {
    "id": "31ff4ca4-0857-4112-aab2-2a69d620365a",
    "name": "Risk Assessment and Framework Development",
    "capability": 0,
    "description": "Risk Assessment and Framework Development entails establishing methodologies and frameworks for identifying, quantifying, and prioritizing risks. This sub-capability supports consistent risk management practices across the organization, aligning risk strategies with business objectives.",
    "parent": "15c9e6a0-6480-4b21-a0e9-38227e2dfca9"
  },
  {
    "id": "d7e37cec-d546-45da-919f-b404b8bf14c5",
    "name": "Scenario Analysis and Stress Testing",
    "capability": 0,
    "description": "Scenario Analysis and Stress Testing involves evaluating the potential impact of extreme but plausible events on the bank's financial position. This sub-capability is essential for understanding vulnerabilities and guiding strategic responses, ensuring that the bank is prepared for unexpected market conditions.",
    "parent": "15c9e6a0-6480-4b21-a0e9-38227e2dfca9"
  },
  {
    "id": "ad4c4d19-75f0-418e-a07e-106168ea3bf2",
    "name": "Risk Culture and Awareness Training",
    "capability": 0,
    "description": "Risk Culture and Awareness Training focuses on fostering a risk-aware culture within the organization through targeted education programs. This sub-capability aims to empower employees with knowledge and tools to identify and manage risks proactively, enhancing overall risk governance.",
    "parent": "15c9e6a0-6480-4b21-a0e9-38227e2dfca9"
  },
  {
    "id": "dbec3cb3-f3d2-4a64-8429-5b11426bf23b",
    "name": "Risk Mitigation Strategy Development",
    "capability": 0,
    "description": "Risk Mitigation Strategy Development formulates and implements strategies to minimize identified risks' impact. This sub-capability ensures that the bank has actionable plans in place to address risks effectively, supporting overall business resilience and performance.",
    "parent": "15c9e6a0-6480-4b21-a0e9-38227e2dfca9"
  },
  {
    "id": "491400f5-f01d-4e3d-af42-f2d234724710",
    "name": "Cloud Infrastructure Management",
    "capability": 0,
    "description": "Manage and optimize the bank's cloud infrastructure, ensuring the efficient deployment and operation of cloud resources. This sub-capability focuses on monitoring cloud performance, cost control, and maintaining operational reliability to support the bank's digital transformation goals.",
    "parent": "6815e0e9-2432-40b4-9db1-371665c7e62f"
  },
  {
    "id": "0745dac4-b94a-4148-ac1c-601017875edb",
    "name": "Cybersecurity Management",
    "capability": 0,
    "description": "Implement and oversee cybersecurity measures to protect the bank’s IT infrastructure from threats and vulnerabilities. This sub-capability is dedicated to ensuring the confidentiality, integrity, and availability of critical systems and data, thereby safeguarding stakeholder interests.",
    "parent": "6815e0e9-2432-40b4-9db1-371665c7e62f"
  },
  {
    "id": "4f401c71-58eb-46bf-a097-e4ec11b33414",
    "name": "Application Lifecycle Management",
    "capability": 0,
    "description": "Oversee the entire lifecycle of IT applications, from planning and development to deployment and sunset. This sub-capability ensures applications align with business objectives and deliver value while adhering to regulatory requirements and quality standards.",
    "parent": "6815e0e9-2432-40b4-9db1-371665c7e62f"
  },
  {
    "id": "ac8f0e39-c7a6-449f-96d9-9256128742ab",
    "name": "Network Operations Management",
    "capability": 0,
    "description": "Administer and maintain the bank's network infrastructure to ensure seamless connectivity and communication across all IT systems. This sub-capability focuses on optimizing network performance, reliability, and security, ultimately enhancing overall operational efficiency.",
    "parent": "6815e0e9-2432-40b4-9db1-371665c7e62f"
  },
  {
    "id": "06aec508-bb9c-41f0-9dbe-d92cf53255e6",
    "name": "Data Center Operations Management",
    "capability": 0,
    "description": "Manage the physical and virtual environments of the bank’s data centers, ensuring optimal performance, reliability, and scalability. This sub-capability integrates infrastructure monitoring, resource allocation, and energy efficiency practices to support business continuity.",
    "parent": "6815e0e9-2432-40b4-9db1-371665c7e62f"
  },
  {
    "id": "1dd6b720-e562-4331-832d-14e559e7d205",
    "name": "Disaster Recovery and Business Continuity Planning",
    "capability": 0,
    "description": "Develop and maintain disaster recovery and business continuity plans to ensure the bank's IT infrastructure can swiftly recover from disruptions. This sub-capability aims to minimize downtime and data loss, thereby protecting customer trust and regulatory compliance.",
    "parent": "6815e0e9-2432-40b4-9db1-371665c7e62f"
  },
  {
    "id": "9a300467-18da-46fc-a428-126164790777",
    "name": "IT Asset Management",
    "capability": 0,
    "description": "Oversee and manage inventory of IT assets, including hardware, software, and licenses. This sub-capability ensures efficient utilization of resources, cost control, and compliance with industry regulations regarding asset lifecycle.",
    "parent": "6815e0e9-2432-40b4-9db1-371665c7e62f"
  },
  {
    "id": "8f38001a-969f-4ea3-87dd-8778bccf3a6c",
    "name": "IT Service Management",
    "capability": 0,
    "description": "Implement and maintain IT service management practices to ensure the delivery of high-quality IT services that meet business needs. This sub-capability focuses on processes such as incident management, problem management, and service desk operations to enhance user satisfaction.",
    "parent": "6815e0e9-2432-40b4-9db1-371665c7e62f"
  },
  {
    "id": "39a3262c-1e22-4356-b562-36508dfd7621",
    "name": "Performance Monitoring and Analytics",
    "capability": 0,
    "description": "Utilize performance monitoring tools and analytics to assess the effectiveness of IT infrastructure. This sub-capability involves setting KPIs, collecting data, and analyzing results to drive continuous improvement in IT service delivery and infrastructure reliability.",
    "parent": "6815e0e9-2432-40b4-9db1-371665c7e62f"
  },
  {
    "id": "27b63bbc-c1f1-44cc-884a-bb1058e92188",
    "name": "Vendor and Contract Management",
    "capability": 0,
    "description": "Manage relationships and contracts with external vendors providing IT services and solutions. This sub-capability ensures that vendor performance aligns with the bank's strategic goals, optimizing value while minimizing risk.",
    "parent": "6815e0e9-2432-40b4-9db1-371665c7e62f"
  },
  {
    "id": "2c46ff77-60ff-4f9c-8232-b74ef2134e84",
    "name": "Personal Banking Services",
    "capability": 0,
    "description": "Offer a comprehensive range of personal banking products including checking accounts, savings accounts, personal loans, and credit cards to enhance customer financial management and satisfaction.",
    "parent": "3e1b456b-1ba3-4759-89bc-2b79350b71a3"
  },
  {
    "id": "dee07384-c7a6-4ee9-97ce-ae6acdb048f8",
    "name": "Mortgage Services",
    "capability": 0,
    "description": "Provide mortgage products tailored to various customer segments, facilitating home ownership through personalized mortgage solutions, competitive rates, and guidance through the application process.",
    "parent": "3e1b456b-1ba3-4759-89bc-2b79350b71a3"
  },
  {
    "id": "f644e795-c62c-446a-95c8-37ddccc40739",
    "name": "Investment Products Management",
    "capability": 0,
    "description": "Develop and manage a diverse suite of investment products such as mutual funds, stocks, and bonds, aimed at helping clients grow their wealth and achieve their financial goals.",
    "parent": "3e1b456b-1ba3-4759-89bc-2b79350b71a3"
  },
  {
    "id": "96107a41-9f75-4293-ae9d-c41914579d24",
    "name": "Business Banking Solutions",
    "capability": 0,
    "description": "Deliver banking services specifically designed for businesses, including business accounts, loans for operational needs, and tailored financial advice to support business growth.",
    "parent": "3e1b456b-1ba3-4759-89bc-2b79350b71a3"
  },
  {
    "id": "34d56a47-97b6-4796-8f34-543c2706fe66",
    "name": "Wealth Management Services",
    "capability": 0,
    "description": "Offer personalized wealth management and financial advisory services to high-net-worth individuals, focusing on investment strategy, estate planning, and risk management.",
    "parent": "3e1b456b-1ba3-4759-89bc-2b79350b71a3"
  },
  {
    "id": "fe185b01-5790-4617-9f17-7563fa9339a6",
    "name": "Financial Planning Services",
    "capability": 0,
    "description": "Provide financial planning expertise to assist customers in setting and achieving their financial objectives through tailored strategies and budgeting tools.",
    "parent": "3e1b456b-1ba3-4759-89bc-2b79350b71a3"
  },
  {
    "id": "952b0a1b-5837-4b9d-9c4e-045b658dc752",
    "name": "Customer Support and Advisory",
    "capability": 0,
    "description": "Deliver exceptional customer support and advisory services across all product lines, ensuring clients receive personalized assistance with their financial decisions.",
    "parent": "3e1b456b-1ba3-4759-89bc-2b79350b71a3"
  },
  {
    "id": "3776c4e7-e913-48bf-897a-d4c9fd55ac5e",
    "name": "Digital Banking Solutions",
    "capability": 0,
    "description": "Enable customers to access banking services digitally through online and mobile platforms, providing convenience and enhancing user experience in managing finances.",
    "parent": "3e1b456b-1ba3-4759-89bc-2b79350b71a3"
  },
  {
    "id": "de6649e0-1fd1-476e-beab-fa21b4eb233e",
    "name": "Payment Solutions",
    "capability": 0,
    "description": "Develop and maintain various payment solutions, including digital wallets, online payment processing, and transaction services, to facilitate seamless financial transactions for customers.",
    "parent": "3e1b456b-1ba3-4759-89bc-2b79350b71a3"
  },
  {
    "id": "0e7117ca-efd2-4397-a76d-1d1f16c59230",
    "name": "Card Services Management",
    "capability": 0,
    "description": "Manage the issuance and servicing of debit, credit, and prepaid cards, focusing on security, customer experience, and innovative features to meet customer needs.",
    "parent": "3e1b456b-1ba3-4759-89bc-2b79350b71a3"
  },
  {
    "id": "86cf4335-64e3-44a6-9a00-eff1ffe12c2d",
    "name": "Financial Budgeting",
    "capability": 0,
    "description": "Manage the preparation and approval of the bank's annual budgets, ensuring resource allocation aligns with strategic goals and financial priorities. This sub-capability provides a structured approach to funding decision-making, promoting accountability and transparency.",
    "parent": "f8d12052-5e8e-4f83-aa72-3d0baa87495c"
  },
  {
    "id": "3b329c72-8593-43f0-b68e-04dd1645d789",
    "name": "Financial Forecasting",
    "capability": 0,
    "description": "Conduct quantitative and qualitative analysis to project the bank's future financial performance based on historical data, market trends, and operational plans. This enables proactive decision-making and helps anticipate potential financial challenges before they arise.",
    "parent": "f8d12052-5e8e-4f83-aa72-3d0baa87495c"
  },
  {
    "id": "652a58af-0391-49ec-882a-24cd714e5869",
    "name": "Performance Analysis",
    "capability": 0,
    "description": "Evaluate and assess the bank's financial performance by comparing actual results against budgets and forecasts to inform strategic adjustments. This sub-capability helps highlight areas of strength and opportunities for improvement, ensuring resources are utilized effectively.",
    "parent": "f8d12052-5e8e-4f83-aa72-3d0baa87495c"
  },
  {
    "id": "29619bc8-ca2d-4dd3-8da7-b1126ead9fe2",
    "name": "Financial Risk Assessment",
    "capability": 0,
    "description": "Identify and quantify the financial risks associated with the bank’s strategies and operations, enabling informed decision-making and risk mitigation. This sub-capability supports the bank's overall risk management efforts by integrating financial perspectives into the risk evaluation process.",
    "parent": "f8d12052-5e8e-4f83-aa72-3d0baa87495c"
  },
  {
    "id": "7754d2cb-666b-4199-a362-74099ddd508d",
    "name": "Capital Structure Management",
    "capability": 0,
    "description": "Manage the bank's capital structure, including equity and debt financing strategies, to optimize financial performance and ensure adequate funding for strategic initiatives. This sub-capability ensures that the bank maintains a healthy balance sheet and meets regulatory requirements.",
    "parent": "f8d12052-5e8e-4f83-aa72-3d0baa87495c"
  },
  {
    "id": "0d9dc272-8a1a-4495-ae64-dff6460d3b68",
    "name": "Cost Management Strategies",
    "capability": 0,
    "description": "Develop and implement strategies for managing and reducing operational costs without compromising service quality or innovation. This supports the bank’s financial health by enhancing profitability through efficient cost control measures.",
    "parent": "f8d12052-5e8e-4f83-aa72-3d0baa87495c"
  },
  {
    "id": "1b1737aa-5e7b-4033-bfa5-6205a077cc25",
    "name": "Investment Strategy Development",
    "capability": 0,
    "description": "Formulate and oversee investment strategies for the bank’s portfolios, ensuring alignment with overall financial goals and risk appetites. This sub-capability contributes to the growth and sustainability of the bank's assets.",
    "parent": "f8d12052-5e8e-4f83-aa72-3d0baa87495c"
  },
  {
    "id": "9edf7ee1-4ecb-46f7-97aa-60854edbb305",
    "name": "Financial Reporting and Compliance",
    "capability": 0,
    "description": "Ensure accurate and timely financial reporting in compliance with regulatory standards and internal policies, enhancing transparency and stakeholder trust. This sub-capability supports strategic decision-making by providing reliable financial information.",
    "parent": "f8d12052-5e8e-4f83-aa72-3d0baa87495c"
  },
  {
    "id": "604e4fbe-52de-4367-91ca-39f3c20757ec",
    "name": "Strategic Scenario Planning",
    "capability": 0,
    "description": "Develop and evaluate multiple financial scenarios to assess potential impacts on the bank’s performance under different economic conditions. This proactive approach enables the bank to adapt its strategies effectively in response to changing circumstances.",
    "parent": "f8d12052-5e8e-4f83-aa72-3d0baa87495c"
  },
  {
    "id": "0f0ebf02-4547-4215-b3fe-b7fbc2e88deb",
    "name": "Stakeholder Engagement in Financial Strategy",
    "capability": 0,
    "description": "Facilitate engagement with key internal and external stakeholders to align financial strategies with broader business objectives and gain insights for continuous improvement. This sub-capability enhances collaboration and strengthens the strategic alignment of financial planning efforts.",
    "parent": "f8d12052-5e8e-4f83-aa72-3d0baa87495c"
  }
]